# #დავალება 2

# print(True and True) # True
# #მესამე ხაზი სწორია, რადგან ორივე მართლია
# print(True and False) # False
# # მეხუთე ხაზი არასწორია, რადგან ერთერი მათგანი არასწორია
# print(False and True) # False
# # მეშვიდე ხაზი , არასწორია რადგან ერთერთი მათგანი არასწორია
# print(False and False) # False 
# # მეცხრე ხაზი არსწორია , რადგამ  ორივე არასწორია


# print(True or True) # True
# # მეცამეტე ხაზი სწორია, რაადგან ორივე სწორია
# print(True or False) # True
# #მეთხუთმეტე ხაზი , სწორია რადგან ერთერი მათგანი სწორიია
# print(False or True) # True
# #მეჩვიდმეტე ხაზი , სწორია რადგან ერთერი მათგანი სწორიია
# print(False or False) # False
# #მეცხრამეტე ხაზი, არსწორია რადგან ორივე არასწორია

# num = 5

# print("----------- AND -----------")

# print(num >= 1 and num <= 10) # True
# #ოცდამეექვსე ხაზი სწორია, რადგან 5 მეტია 1-ზე და 5 ნაკლებია 10-ზე
# print(num >= 1 and num <= 4) # False
# #ოცდამერვე ხაზი არასწორია, რადგან 5 მეტია 4-ზე
# print(num > 5 and num <= 10) # False
# #ოცდამეათე ხაზი არსწორია , რადგან  5 ტოლია 5-ის
# print(num > 5 and num > 10) # False
# #ოცდამეთრმეტე ხაზი არასწორია , რადგან  5 ტოლია 5ის და 5 ნაკლებია 10-ის

# print("----------- OR -----------")

# print(num >= 1 or num <= 10) # True
# #ოცდამეჩვუდმეტე ხაზი სწორია , რადგან 5 მეტია 1-ზე და 5 ნაკლებია 10ზე
# print(num >= 1 or num <= 4) # True
# #ოცდამეცხრამეტე ხაზი სწორია , რადგან ერთერთი მათგანი სწორია
# print(num > 5 or num <= 10) # True
# #ორმოცდაპირველი ხაზი სწორია , რადგან ერთერი მათგანი სწორია
# print(num > 5 or num > 10) # Falsე
#ორმოცდამესამე ხაზი არასწორია , რადგან ორივე არასწორია

#დავალება 3
 # "and" ოპერატორი მკაცრია ვიდრე "or" ოპერატორი, რადგან როდესაც "and" ს ვიყენებთ და მათთაგან ერთერი თუ არაწორია ეს მთლიანად არასწორი იქნება
 # და "or" ოპერატორს ვიყენებთ მათთაგან ერთერი მაინც უნდა იყოს სწორი თუ გვინდა რომ სწორი შედეგი მივიღოთ


#დავალება 4

num1 = 15

# print (num1 > 11 and num1 < 20)
# print (num1 >= 15 and num1 <= 34)
# print (num1 < 20 and num1 > 11)
# print (num1 >= 3 and num1 ==  15)
# print (num1 == 15 and num1 > 20)


# print (num1 < 11 or num1 > 20)
# print (num1 >= 15 or num1 <= 34)
# print (num1 < 20 or num1 <11)
# print (num1 >= 3 or num1 ==  15)
# print (num1 == 15 or num1 > 20)


#დავალება 5

num2 = 5
num3 = 6

print(num2 < num3)
print(num2 <= num3)
print(num2 > num3)
print(num2 >= num3)
print(num2 == num3)