#იპოვეთ ლისტში ყველაზე პატარა წევრი min ფუნქციის გამოყენების გარეშე.
num1=[33,648,11,2,44,12,1,55]
num1.sort()
print(num1)
print(num1[0])


# 2) იპოვეთ ლისტში ყველაზე დიდი წევრი max ფუნქციის გამოყენების გარეშე.
# num1=[33,648,11,2,44,12,1,55]
# num1.sort()
# print(num1)
# print(num1[-1])

# 3) შემოგდით სია სადაც არის მინიმუმ 6 ელემენტი და თქვენი დავალებაა გამოიტანოთ 1 - 3 და 5 წევრების ინდექსები.
# num1=[1,2,3,4,5,6]
# print(num1[0:6:2])

# 4) შემოგდით 2 სია აქედან ერთში არის მხოლოდ ინტეჯერები და მეორეში არის მხოლოდ სტრინგები. თქვენი დავალებაა გააერთიანოთ ეს ორი ლისტი ისე რომ ყოველი ინტეჯერის 
# შემდეგ მოდიოდეს სტრინგი(ანუ თანმიმდევრობით str - int - str - int ან პირიქით).
# num1=[1,2,3,4,5,6]
# num2=["a","b","c","d","e","f"]
# num3=[None] *( len(num1) + len(num2))
# num3[0::2]=num1
# num3[1::2]=num2
# print(num3)


# 5) შემოგდით სია სადაც არის სტრინგები და ინტეჯერები. თქვენი დავალებაა ამ სიიდან ამოიღოთ თოეული წევრი და ინტეჯერები მოატავსოთ ცალკე სიაში ხოლო სტრინგები ცალკე სიაში.
# num1=[1, 'a', 2, 'b', 3, 'c', 4, 'd', 5, 'e', 6, 'f']
# num2=[]
# num3=[]
# for i in num1:
#     if type(i) == int:
#         num2.append (i)
#     else:
#         num3.append (i)
# print(num2)
# print(num3)



# 6) შემოგდით 4 სია და თქვენი დავალებაა ამ ორი სიიდან ამოიღოთ კენტები და ლუწები და დაპრინტოთ მათი ჯამი ცალ-ცალკე.
# num1=[1,2,3,4,5,6]
# even=0
# odd=0
# for i in num1:
#     if i % 2 == 0 :
#         even += i 
#     else :
#         odd += i 
# print(even)
# print(odd)

# 7) შემოგდით 4 სია და თქვენი დავალებაა ამ სიებიდან ამოიღოთ კენტები და ლუწები და განათავსოთ ისინი ორ სხვადასხვა სიაში.
# num1=[1,2,3,4,5,6,7,8,9] 
# num2=[11,22,33,44,55,66,77]
# num3= [12,13,14,15,16,17,18]
# num4=[21,31,41,51,61,71,81]
# num5=[]
# num6=[]
# for i in num1 :
#     if i % 2 == 0 :
#         num5.append (i)
#     else :
#         num6.append(i)

# for i in num2 :
#     if i % 2 == 0 :
#         num5.append (i)
#     else :
#         num6.append(i)

# for i in num3 :
#     if i % 2 == 0 :
#         num5.append (i)
#     else :
#         num6.append(i)

# for i in num4 :
#     if i % 2 == 0 :
#         num5.append (i)
#     else :
#         num6.append(i)

# print(num6)
# print(num5)


# 8) შემოგდით სია სადაც არის მხოლოდ სტრინგები და თქვენ გევალებათ გაიგოთ ყველა ამ ელემენტების სიგრძე შეიყვანოთ მეორე სიაში(იგივე თანმიმდევრობით).
# num1= ["apple","banana","cherry","deer","elephant"]
# num2=[]
# for i in num1 :
#     num2.append(len(i))
# print(num2)

# 9) შემოგდით რამდენიმე სია (სტრინგებიც და ინტეჯერებიც) თქვენი დავალებაა ყველა ინტეჯერი შეკრიბოთ და ყველა სტრინგი შეაერთოთ.
# num1=[1, 'a', 2, 'b', 3, 'c', 4, 'd', 5, 'e', 6, 'f']
# num2=0
# num3=""
# for i in num1 :
#     if type (i) == int :
#         num2 += i
#     else :
#         num3 += i
# print(num2)
# print(num3)

# 10) შემოგდით სია თქვენი ადვალებაა ამ სიიდან ლუწ ინდექსე მყოფი ელემენტები გადაიტანოთ ახალ სიაში საბოლოოდ კი გამოიტანოთ ტერმინალში.

# num1=[1,2,3,4,5,6,7,8,9]
# num2=[]
# num2.append(num1[0::2])
# print(num2)